TITLE                                          = "USB Device Firmware Upgrade";

GROUP_DEVICE_TITLE                             = "Gerät";
GROUP_DEVICE_LABEL_MANUFACTURER                = "Hersteller:";
GROUP_DEVICE_LABEL_PRODUCT                     = "Produkt:";
GROUP_DEVICE_LABEL_VID_PID                     = "VID/PID:";
GROUP_DEVICE_LABEL_SERIAL_NUMBER               = "Seriennummer:";
GROUP_DEVICE_LABEL_FIRMWARE_VERSION            = "Aktuelle Firmware:";

GROUP_FIRMWARE_TITLE                           = "Firmware";
GROUP_FIRMWARE_BUTTON_BROWSE                   = "Durchsuchen...";

GROUP_UPGRADE_TITLE                            = "Aktualisierung";
GROUP_UPGRADE_STATUSTEXT_IDLE                  = "";
GROUP_UPGRADE_STATUSTEXT_OPEN_DEVICE           = "Ein Gerät wurde geöffnet.";
GROUP_UPGRADE_STATUSTEXT_READY                 = "Bereit zum Aktualisieren der Firmware.";
/* NOTE: The strings $CurVer$ and $NewVer$ are placeholders for the current and new firmware
 version and must not be changed! They must be present in every translation. */
GROUP_UPGRADE_STATUSTEXT_READY_VERSION         = "Bereit zum Aktualisieren der Firmware von Version $CurVer$ auf $NewVer$.";
GROUP_UPGRADE_STATUSTEXT_INIT                  = "Initialisierung...";
GROUP_UPGRADE_STATUSTEXT_ENTER_DFU             = "Starte Aktualisierungsmodus...";
GROUP_UPGRADE_STATUSTEXT_IN_PROGRESS           = "Firmware wird aktualisiert...";
/* NOTE: The strings $CurrentBytes$ and $TotalBytes$ are placeholders for the number of
 already transferred and the number of total bytes to transfer. They must not
 be changed! They must be present in every translation. */
GROUP_UPGRADE_STATUSTEXT_TRANSFER_PROGRESS     = "$CurrentBytes$ von $TotalBytes$ Bytes übertragen.";
GROUP_UPGRADE_STATUSTEXT_ENTER_APP             = "Firmware wird gestartet...";
GROUP_UPGRADE_STATUSTEXT_SUCCESS               = "Die Firmware wurde erfolgreich aktualisiert.";
GROUP_UPGRADE_STATUSTEXT_FAILED                = "Die Aktualisierung der Firmware ist fehlgeschlagen!";
/* NOTE: The string $NewVer$ is a placeholder for the version of the new firmware and
 must not be changed! It must be present in every translation. */
GROUP_UPGRADE_STATUSTEXT_NOT_REQUIRED          = "Die neue Firmwareversion ist $NewVer$. Die Firmware des Gerätes ist identisch oder neuer. Eine Aktualisierung ist nicht erforderlich.";
GROUP_UPGRADE_STATUSTEXT_REPEAT_ON_ERROR       = "Eine weitere Aktualisierung ist erforderlich. Der Vorgang wird wiederholt.";
GROUP_UPGRADE_BUTTON_START                     = "Start";

BUTTON_CLOSE                                   = "Beenden";

MESSAGE_BOX_ERROR_TITLE                        = "Fehler";
MESSAGE_BOX_INFO_TITLE                         = "Hinweis";
MESSAGE_BOX_BUTTON_YES                         = "Ja";
MESSAGE_BOX_BUTTON_NO                          = "Nein";

/* NOTE: The strings $Caller$, $Function$ and $ErrorCode$ are placeholders for error-dependent information
 and must not be changed! They must be present in every translation. */
ERROR_MESSAGE_COMMON                           = "$Caller$: Funktion $Function$ fehlgeschlagen mit Fehler $ErrorCode$.";
ERROR_MESSAGE_UPGRADE_FAILED                   = "Die Firmwareaktualisierung ist fehlgeschlagen. Für einen erneuten Versuch schalten Sie das Gerät bitte aus \
                                                  und trennen es vom System. Schalten Sie es anschließend wieder ein und verbinden es wieder.";
ERROR_MESSAGE_NO_FIRMWARE_FILE_AVAILABLE       = "Für dieses Gerät ist keine Firmware verfügbar.";
ERROR_MESSAGE_OPEN_FIRMWARE_FILE_FAILED        = "Die Firmwaredatei konnte nicht geöffnet werden.";
ERROR_MESSAGE_INVALID_FIRMWARE_FILE            = "Die Firmwaredatei ist ungültig.";
ERROR_MESSAGE_READ_FIRMWARE_FILE_FAILED        = "Die Firmwaredatei konnte nicht gelesen werden.";
ERROR_MESSAGE_NO_DEVICE                        = "Kein Gerät gefunden. Bitte schließen Sie das zu aktualisierende Gerät an.";
ERROR_MESSAGE_TOO_MANY_DEVICES                 = "Mehr als ein Gerät gefunden. Bitte schließen Sie genau ein Gerät an.";

QUESTION_YESNO_CONFIRM_TO_ABORT                = "Die Firmware wird gerade aktualisiert. Wenn Sie jetzt abbrechen, kann das Gerät beschädigt werden. Möchten Sie wirklich abbrechen?";
QUESTION_YESNO_CONFIRM_TO_DOWNGRADE            = "Die Version der Firmware auf dem Gerät ist identisch oder neuer. Wollen Sie wirklich fortfahren?";

